#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Условие задания №1
# написать программу, которая считывает текст из файла и выводит на экран сначала вопросительные,
# а затем восклицательные предложения.
if __name__ == "__main__":
    sequence = ''
    Vos = '' #Восклицательные
    Vop = '' #Вопросительные
    with open('Zadanie1.txt', 'r', encoding='utf-8') as file:
        text = file.read()
        file.close()
        for i in text:
            sequence += i
            if i == '!':
                Vos+=sequence #Записываем предложение в хранилище
                sequence=''
            elif i == '?':
                Vop+=sequence
                sequence=''
            elif i == '.':
                sequence=''
        print("Восклицательные:", Vos)
        print()
        print("Вопросительные:", Vop)
